In [4]:
import pandas as pd
import numpy as np

In [7]:
df1 = pd.DataFrame(np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12]]), columns=['feature 1','feature 2','feature 3', 'feature 4'])

In [8]:
df1

   feature 1  feature 2  feature 3  feature 4
0          1          2          3          4
1          5          6          7          8
2          9         10         11         12

In [9]:
df1['feature 2']

0     2
1     6
2    10
Name: feature 2, dtype: int32

In [10]:
df1['feature 2'][0]

2

In [11]:
df1.columns

Index(['feature 1', 'feature 2', 'feature 3', 'feature 4'], dtype='object')

In [12]:
df1.values

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [19]:
df1[df1['feature 2'] > 3]

   feature 1  feature 2  feature 3  feature 4
1          5          6          7          8
2          9         10         11         12

In [33]:
print(df1.sort_values(by='feature 4', ascending=False))
print(df1)

   feature 1  feature 2  feature 3  feature 4
2          9         10         11         12
1          5          6          7          8
0          1          2          3          4
   feature 1  feature 2  feature 3  feature 4
0          1          2          3          4
1          5          6          7          8
2          9         10         11         12

In [35]:
df1.rename({'feature 1': 'best feature'},axis=1)

   best feature  feature 2  feature 3  feature 4
0             1          2          3          4
1             5          6          7          8
2             9         10         11         12

In [37]:
df1['feature 5'] = np.array([12,13,14])

In [38]:
df1

   feature 1  feature 2  feature 3  feature 4  feature 5
0          1          2          3          4         12
1          5          6          7          8         13
2          9         10         11         12         14

In [41]:
df1.drop('feature 5', axis=1)

   feature 1  feature 2  feature 3  feature 4
0          1          2          3          4
1          5          6          7          8
2          9         10         11         12

In [42]:
df1.append(pd.DataFrame(np.array([30,31,32,33])))

   feature 1  feature 2  feature 3  feature 4  feature 5     0
0        1.0        2.0        3.0        4.0       12.0   NaN
1        5.0        6.0        7.0        8.0       13.0   NaN
2        9.0       10.0       11.0       12.0       14.0   NaN
0        NaN        NaN        NaN        NaN        NaN  30.0
1        NaN        NaN        NaN        NaN        NaN  31.0
2        NaN        NaN        NaN        NaN        NaN  32.0
3        NaN        NaN        NaN        NaN        NaN  33.0

In [46]:
df1.append(pd.DataFrame(np.array([[30,31,32,33,34]]),columns=df1.columns))

   feature 1  feature 2  feature 3  feature 4  feature 5
0          1          2          3          4         12
1          5          6          7          8         13
2          9         10         11         12         14
0         30         31         32         33         34

In [47]:
df1.loc(0)

In [50]:
df1.loc[0]

feature 1     1
feature 2     2
feature 3     3
feature 4     4
feature 5    12
Name: 0, dtype: int32